%задание 4
matr1=[1,1,0,0,1,0;
       0,1,0,0,1,0;
       1,1,1,0,1,0;
       1,1,1,1,1,0;
       0,1,0,0,1,0;
       1,1,1,1,1,1;]
vec1=[1;
      1;
      1;
      1;
      1;
      1;]
it1=matr1*vec1
it2=matr1*it1   
disp("итеративная сила критериев")
it3=matr1*it2
disp("Значимость качества зерна")
disp(it3(1)/sum(it3))
%задание 5
coeff = [0.4,0.25,0.25,0.2;
         0.4,0.15,0.3,0.3;
         0.1,0.3,0.25,0.25;
         0.1,0.3,0.25,0.25]
matrixExp = coeff;
rangs=[1.5,3,3,4;
       1.5,4,1,1;
       3.5,1.5,3,2.5;
       3.5,1.5,3,2.5;]
s=sum(rangs,2);
s2=sum(rangs/4,2);
d=s-s2;
disp("Сумма рангов по каждому объекту")
disp(s)
disp("среднее значения суммы рангов по всем объектам оценивания ")
disp(s2)
disp("Отклонение суммы рангов от среднего значения ")
disp(d)
T=[2^3-2,2^3-2,3^3-3,2^3-2];
disp("Показатель, характеризующий равные ранги")
disp(T)
disp("Коэффициент конкордации, выводы о согласованности мнений экспертов")
W=0
for j=1:4
    W=W+d(j)/(4^2*(4^3-4)-4*sum(T))
end
disp("Коэффициент конкордации, выводы о согласованности мнений экспертов")
W=12*W
